Repository: myyra/agent-eid
Catalog: Shared/Resources/Localizable.xcstrings
Source language: en
Languages: fi, sv

# app.display_name
source: AgentEID
fi: Agenttitunnistus
sv: Agentidentifiering

# card.certificate.default_label
source: Certificate
fi: Varmenne
sv: Certifikat

# card.default_label
source: Finnish ID card
fi: Suomalainen henkilökortti
sv: Finländskt identitetskort

# common.actions.cancel.title
source: Cancel
fi: Peruuta
sv: Avbryt

# errors.card_data.cannot_register_issuer_certificate
source: cannot register the public issuer certificate (%1$(status)d)
fi: myöntäjän julkista varmennetta ei voi rekisteröidä (%1$(status)d)
sv: det går inte att registrera det offentliga utfärdarcertifikatet (%1$(status)d)

# errors.card_data.description
source: Cannot read the card data: %1$(detail)@.
fi: Kortin tietoja ei voi lukea: %1$(detail)@.
sv: Det går inte att läsa kortets data: %1$(detail)@.

# errors.card_data.file_range_exceeds_size
source: file range exceeds file size
fi: lukualue ylittää tiedoston koon
sv: läsintervallet överskrider filstorleken

# errors.card_data.incomplete_file_read
source: incomplete file read
fi: tiedosto luettiin vain osittain
sv: filen lästes endast delvis

# errors.card_data.invalid_asn1_field
source: invalid ASN.1 field
fi: virheellinen ASN.1-kenttä
sv: ogiltigt ASN.1-fält

# errors.card_data.invalid_asn1_record
source: invalid ASN.1 record
fi: virheellinen ASN.1-tietue
sv: ogiltig ASN.1-post

# errors.card_data.invalid_digest_length
source: incorrect signature digest length
fi: virheellinen allekirjoitettavan tiivisteen pituus
sv: felaktig längd på hashvärdet som ska signeras

# errors.card_data.invalid_file_path_or_range
source: invalid file path or range
fi: virheellinen tiedostopolku tai lukualue
sv: ogiltig filsökväg eller ogiltigt läsintervall

# errors.card_data.invalid_file_size
source: invalid file size
fi: virheellinen tiedostokoko
sv: ogiltig filstorlek

# errors.card_data.invalid_private_key_metadata
source: invalid private-key metadata
fi: virheelliset yksityisen avaimen metatiedot
sv: ogiltiga metadata för privat nyckel

# errors.card_data.invalid_record_length
source: invalid length
fi: virheellinen pituus
sv: ogiltig längd

# errors.card_data.invalid_signature_length
source: invalid ECDSA signature length
fi: virheellinen ECDSA-allekirjoituksen pituus
sv: ogiltig längd på ECDSA-signaturen

# errors.card_data.invalid_x509_certificate
source: invalid X.509 certificate
fi: virheellinen X.509-varmenne
sv: ogiltigt X.509-certifikat

# errors.card_data.missing_asn1_field
source: missing ASN.1 field
fi: ASN.1-kenttä puuttuu
sv: ASN.1-fält saknas

# errors.card_data.missing_file_size
source: missing file size in SELECT response
fi: tiedoston koko puuttuu SELECT-vastauksesta
sv: filstorleken saknas i SELECT-svaret

# errors.card_data.missing_serial_number
source: missing card serial number
fi: kortin sarjanumero puuttuu
sv: kortets serienummer saknas

# errors.card_data.missing_token_keychain_contents
source: missing token keychain contents
fi: tunnisteen avainnipun sisältö puuttuu
sv: tokenens nyckelringsinnehåll saknas

# errors.card_data.no_card
source: Insert an ID card into the reader.
fi: Aseta henkilökortti lukijaan.
sv: Sätt in ett identitetskort i läsaren.

# errors.card_data.record_too_large
source: record size exceeds the limit
fi: tietueen koko ylittää rajan
sv: poststorleken överskrider gränsen

# errors.card_data.truncated_record
source: truncated record
fi: tietue on katkennut
sv: posten är ofullständig

# errors.card_data.unsupported_asn1_structure
source: unsupported tag, length or nesting
fi: tunnistetta, pituutta tai sisäkkäisyyttä ei tueta
sv: taggen, längden eller nästlingen stöds inte

# errors.card_data.unsupported_authentication_key_profile
source: unsupported or ambiguous authentication-key profile
fi: tunnistusavaimen profiilia ei tueta tai se on moniselitteinen
sv: autentiseringsnyckelns profil stöds inte eller är tvetydig

# errors.card_data.unsupported_directory_entry
source: unsupported object-directory entry
fi: objektihakemiston merkintää ei tueta
sv: objektkatalogposten stöds inte

# errors.card_data.unsupported_signing_algorithms
source: no supported EC signing algorithm; found %1$(references)@
fi: tuettua EC-allekirjoitusalgoritmia ei ole; löydetyt algoritmit: %1$(references)@
sv: ingen EC-signaturalgoritm som stöds; hittade algoritmer: %1$(references)@

# errors.card_data.zero_signature_component
source: zero ECDSA signature component
fi: ECDSA-allekirjoituksen osan arvo on nolla
sv: en ECDSA-signaturkomponent är noll

# errors.card_status.authentication_required
source: The card requires authentication for this operation.
fi: Kortti edellyttää tunnistautumista tätä toimintoa varten.
sv: Kortet kräver autentisering för den här åtgärden.

# errors.card_status.file_not_found
source: The selected application or file is not present on this card.
fi: Valittua sovellusta tai tiedostoa ei ole tällä kortilla.
sv: Den valda applikationen eller filen finns inte på kortet.

# errors.card_status.success
source: The card operation succeeded.
fi: Korttitoiminto onnistui.
sv: Kortåtgärden lyckades.

# errors.card_status.unknown
source: The card returned status %1$(status)@.
fi: Kortti palautti tilakoodin %1$(status)@.
sv: Kortet returnerade statuskoden %1$(status)@.

# errors.keychain.description
source: Keychain: %1$(detail)@
fi: Avainnippu: %1$(detail)@
sv: Nyckelring: %1$(detail)@

# errors.pin_provider.authentication_not_enabled_for_card
source: Keychain authentication is not enabled for this card. Save PIN1 in Settings or use the macOS PIN prompt.
fi: Tunnistautuminen avainnipun avulla ei ole käytössä tälle kortille. Tallenna PIN1 asetuksissa tai käytä macOS:n PIN-kyselyä.
sv: Identifiering med nyckelringen är inte aktiverad för det här kortet. Spara PIN1 i Inställningar eller använd PIN-dialogrutan i macOS.

# errors.pin_provider.missing_access_group
source: Shared Keychain access is not configured. Sign the app and extension with the same development team.
fi: Jaettua avainnippua ei ole määritetty. Allekirjoita appi ja laajennus samalla kehittäjätiimillä.
sv: Åtkomst till den delade nyckelringen är inte konfigurerad. Signera appen och tillägget med samma utvecklarteam.

# errors.pin_provider.saved_pin_required
source: Save PIN1 in Keychain before enabling Keychain authentication.
fi: Tallenna PIN1 avainnippuun ennen kuin otat tunnistautumisen avainnipun avulla käyttöön.
sv: Spara PIN1 i nyckelringen innan du aktiverar identifiering med nyckelringen.

# errors.reader.access_unavailable
source: Smart-card access is unavailable.
fi: Älykorttien käyttö ei ole mahdollista.
sv: Åtkomst till smartkort är inte tillgänglig.

# errors.system.status
source: Error %1$(status)d
fi: Virhe %1$(status)d
sv: Fel %1$(status)d

# keychain.saved_pin.label
source: AgentEID PIN1
fi: Agenttitunnistus PIN1
sv: Agentidentifiering PIN1

# menu.actions.quit.title
source: Quit
fi: Lopeta
sv: Avsluta

# menu.actions.settings.title
source: Settings
fi: Asetukset
sv: Inställningar

# menu.card.prepare.retry.title
source: Try again
fi: Yritä uudelleen
sv: Försök igen

# menu.card.status.absent
source: No card
fi: Ei korttia
sv: Inget kort

# menu.card.status.detecting
source: Detecting card
fi: Tunnistetaan korttia
sv: Identifierar kortet

# menu.card.status.inserted
source: Card inserted
fi: Kortti on lukijassa
sv: Kortet är insatt

# menu.card.status.not_responding
source: Card not responding
fi: Kortti ei vastaa
sv: Kortet svarar inte

# menu.card.status.preparation_failed
source: Couldn’t prepare card
fi: Kortin valmistelu epäonnistui
sv: Det gick inte att förbereda kortet

# menu.card.status.preparing
source: Preparing card…
fi: Valmistellaan korttia…
sv: Förbereder kortet…

# menu.card.status.ready
source: Card ready
fi: Kortti on valmis
sv: Kortet är klart

# menu.reader.status.disconnected
source: Reader disconnected
fi: Kortinlukija on irrotettu
sv: Kortläsaren är frånkopplad

# menu.reader.status.unavailable
source: Reader unavailable
fi: Kortinlukija ei ole käytettävissä
sv: Kortläsaren är inte tillgänglig

# menu.readers.connect.title
source: Connect a card reader
fi: Liitä kortinlukija
sv: Anslut en kortläsare

# settings.authentication.load.retry.title
source: Retry loading settings
fi: Lataa asetukset uudelleen
sv: Läs in inställningarna igen

# settings.authentication.method.label
source: Authentication method
fi: Tunnistautumistapa
sv: Identifieringsmetod

# settings.authentication.saved_pin.change.title
source: Change saved PIN1…
fi: Vaihda tallennettu PIN1…
sv: Ändra sparad PIN1…

# settings.authentication.saved_pin.forget.title
source: Forget PIN1
fi: Poista PIN1
sv: Ta bort PIN1

# settings.authentication.update.progress
source: Updating authentication settings…
fi: Päivitetään tunnistautumisasetuksia…
sv: Uppdaterar autentiseringsinställningar…

# settings.pin_setup.input.hint
source: 4–12 digits (0–9).
fi: 4–12 numeroa (0–9).
sv: 4–12 siffror (0–9).

# settings.pin_setup.save.title
source: Save and use PIN1
fi: Tallenna PIN1 ja ota käyttöön
sv: Spara och använd PIN1

# errors.card_data.invalid_pin
source: PIN must contain %1$(minimumLength)lld–%2$(maximumLength)lld digits
sv: PIN-koden måste innehålla %1$(minimumLength)lld–%2$(maximumLength)lld siffror

# errors.card_data.invalid_pin_metadata
source: invalid PIN metadata or length limits
sv: ogiltiga PIN-metadata eller längdgränser

# errors.card_status.verification_failed
source: PIN was not verified. %1$(attempts)lld attempts remain.
sv: PIN-koden verifierades inte. %1$(attempts)lld försök återstår.

# errors.pin_provider.invalid_card_id
source: Read the ID card before saving PIN1.
sv: Läs identitetskortet innan du sparar PIN1.

# errors.pin_provider.invalid_pin
source: PIN1 must contain 4–12 ASCII digits.
sv: PIN1 måste innehålla 4–12 siffror (0–9).

# errors.pin_provider.invalid_stored_pin
source: The saved PIN item is malformed.
sv: Den sparade PIN-postens data är felaktiga.

# errors.pin_provider.invalid_stored_settings
source: The saved PIN item has no valid authentication settings.
sv: Den sparade PIN-posten saknar giltiga identifieringsinställningar.

# errors.pin_provider.no_saved_pin
source: No PIN1 is saved. Save it in Settings or use the macOS PIN prompt.
sv: Ingen PIN1 är sparad. Spara den i Inställningar eller använd PIN-dialogrutan i macOS.

# errors.pin_provider.settings_changed
source: The saved PIN changed while saving settings. Please try again.
sv: Den sparade PIN-koden ändrades medan inställningarna sparades. Försök igen.

# errors.pin_provider.single_card_required
source: Insert a single ID card to save its PIN1.
sv: Sätt in endast ett identitetskort för att spara PIN1.

# settings.authentication.methods.native.title
source: Ask for PIN1
sv: Fråga efter PIN1

# settings.authentication.methods.saved_pin.title
source: Use saved PIN1
sv: Använd sparad PIN1

# settings.pin_setup.description
source: Insert your card to verify and save PIN1. The saved PIN is used only for this card, on this Mac.
sv: Sätt in ditt kort för att kontrollera och spara PIN1. Den sparade PIN-koden används endast för detta kort på denna Mac.

# settings.pin_setup.save.progress
source: Verifying and saving PIN1…
sv: Verifierar och sparar PIN1…
